In [5]:
print("First Time")

First Time

In [50]:
id([1, 2, 3])

139939105659968

In [51]:
id([1, 2, 3])

139939105280768

In [52]:
def get_memory_address(arr):
    return arr.__array_interface__["data"][0]

In [53]:
a = np.array([1, 2, 3])

In [54]:
get_memory_address(a[1:])

94472628894056

In [55]:
id(a)

139939105441712

In [67]:
dir(1)

['__abs__',
 '__add__',
 '__and__',
 '__bool__',
 '__ceil__',
 '__class__',
 '__delattr__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__float__',
 '__floor__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getnewargs__',
 '__gt__',
 '__hash__',
 '__index__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__le__',
 '__lshift__',
 '__lt__',
 '__mod__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rlshift__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rrshift__',
 '__rshift__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__trunc__',
 '__xor__',
 'as_integer_ratio',
 'bit_length',
 'conjugate',
 'denominator',
 'from_bytes',
 'imag',
 'numerator',
 'real',
 'to_bytes']

<li>This will give me all the methods associated with the value passed inside dir().</li>

In [70]:
# help()

## Importing necessary libraries

In [59]:
import os
import numpy as np
import pandas as pd
from tqdm import tqdm
import seaborn as sns
import matplotlib.pyplot as plt

## Providing path to data

In [2]:
data_path = os.path.join(os.getcwd(), 'data', 'titanic.csv')
print(data_path)

/home/fm-pc-lt-219/Desktop/Master_In_DataScience_TU/Fundamentals_Of_Data_Science/data/titanic.csv

## Loading the data using pandas dataframe

In [4]:
df = pd.read_csv(data_path)

## Checking the shape of the dataframe

In [6]:
print(df.shape)

(891, 12)

## Viewing the top 5 rows of the dataframe using .head() method

In [8]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Viewing the last 5 rows of the dataframe using .tail() method

In [9]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## Checking the datatype of pandas dataframe

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Checking the descriptive statistics about the data

In [11]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Insights From First Glance

<li>There are 12 features in the titanic dataset.</li>
<li>There are 891 rows in this dataset.</li>
<li>There are 5
<li>PassengerId is the unique id provided to each passenger in a titanic boat. So, this feature doesnot hold any significance in determining whether the patient is survived or not. So, we can drop this column</li>

In [57]:
df.drop('PassengerId', axis = 1, inplace = True)
df.shape

(891, 11)

## Data Cleaning

<li>Checking duplicate Entries</li>
<li>Checking missing values & handling them</li>

In [14]:
df[df.duplicated()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

<li>There are no duplicate entries in this dataset.</li>

In [15]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

<li>There are 2 null values in 'Embarked' feature, 177 null values in 'Age' feature and 687 null values in 'Cabin' feature.</li>
<li>We need to handle these missing values but we will do it after data explortion.</li>

## EDA 
<li>Univariate Analysis</li>
<li>Bivariate Analysis</li>
<li>Multivariate Analysis</li>

In [63]:
def univariate_counts(df, feature):
    count_df = df[feature].value_counts().reset_index()
    count_df.columns = [feature, 'Frequency']
    return count_df

In [71]:
target_df = univariate_counts(df, 'Survived')
target_df.head()

   Survived  Frequency
0         0        549
1         1        342

In [ ]:
plt.piechart(target_df)